app/Models/FilmModel.php

    public function getAllData(){
       return $this->findAll();
---
SELECT *
FROM `film`